tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "getantibody/tap"
tap "heroku/brew"
tap "homebrew/apache"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/php"
tap "homebrew/services"
tap "homebrew/versions"

# CLI tools

brew "getantibody/tap/antibody"
brew "ansible"
brew "ansible-lint"
brew "bash"
brew "curl", args: ["with-openssl"]
brew "diff-so-fancy"
brew "docker-clean"
brew "dockutil"
brew "fzf"
brew "geoip"
brew "git"
brew "git-secret"
brew "gnupg"
brew "gpg-agent"
brew "go"
brew "highlight"
#brew "htop"
brew "httpie"
brew "iftop"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "mas"
brew "mercurial"
brew "nmap"
brew "openssl"
brew "pinentry-mac"
brew "pyenv"
brew "python3"
brew "rmtrash"
brew "rust"
brew "shellcheck"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "tig"
brew "tree"
brew "ttyrec"
brew "ttygif"
brew "vim"
brew "wget"
brew "z"
brew "zsh"
brew "zsh-completions"

cask "anki"
cask "docker"
cask "flux"
cask "gpg-suite"
cask "iterm2"
cask "keyboard-cleaner"
cask "parallels"
cask "postman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "sequel-pro"
cask "skype7"
cask "sequel-pro"
cask "sublime-text"
cask "teamviewer"
cask "the-unarchiver"
cask "tunnelblick"
cask "vagrant"
cask "vagrant-manager"
cask "wkhtmltopdf"

# Fonts
cask "caskroom/fonts/font-consolas-for-powerline"
cask "caskroom/fonts/font-fira-code"
cask "caskroom/fonts/font-inconsolata"
cask "caskroom/fonts/font-inconsolata-for-powerline"
cask "caskroom/fonts/font-roboto-mono"
cask "caskroom/fonts/font-roboto-mono-for-powerline"

# App Store Applications
mas "Xcode", id: 497799835
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Encrypto", id: 935235287
mas "Airmail 3", id: 918858936
mas "Microsoft Remote Desktop 8", id: 715768417
mas "CopyClip", id: 595191960
mas "Todoist", id: 585829637
mas "App Cleaner", id: 1013897218
